#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/diogoleal/crispy-succotash/runs/run-QHMPuvZyNkGwuZNw

Waiting for the plan to start...

Terraform v1.1.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-040df037d6555d1df]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-01b4a3539f5358639]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0d01ecdccffefaf21]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-0590e8c0ec46c7d71]
aws_kms_key.this: Refreshing state... [id=aa7756c0-2ac5-4dca-8f61-31ddd4691e82]
aws_placement_group.web: Refreshing state... [id=k8s]
module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-0a794323e79f76d24]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0dd65eadbf8703302]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-09bd67e5c4a4d82f8]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-099108e6442cec8d5]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-010d347b459cf08c9]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-088923d826089a7e4]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0bb7330f8f8fb1149]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-00292935f495f11d2]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-07bf79a4135dbe509]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0e951bef62e7f9382]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0080b39774813ce59]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0c7fab9d89b050b47]
module.k8s_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0d8b1a4c4f90bd0c5]
module.rancher_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0321522566ee1801f]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-02933c8348fc69b1a]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0aa3b4163ef6d4125]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f67b3d1b0e77bb92]
aws_network_interface.this: Refreshing state... [id=eni-0c4c2e55727ebf0cd]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-00cb1d9e5e8a3d44f]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-082d5751824a27a1f]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-0f718fe0fd097b88b]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-052731577696171e0]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-06a372f51e83499a0]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-062efe636b7fb5060]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0dd65eadbf87033021080289494]
module.k8s_security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-186810089]
module.k8s_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-2435911718]
module.rancher_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1184628173]
module.rancher_security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-3271754956]
module.k8s_instance[2].aws_instance.this[0]: Refreshing state... [id=i-06a20f7cc5a65b87e]
module.k8s_instance[0].aws_instance.this[0]: Refreshing state... [id=i-085ab12c4af807db2]
module.k8s_instance[1].aws_instance.this[0]: Refreshing state... [id=i-0e8733edeb930947d]
module.ec2_instance.aws_instance.this[0]: Refreshing state... [id=i-070cc72d83083706a]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-010d347b459cf08c91080289494]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-07bf79a4135dbe5091080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-00292935f495f11d21080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vpc.aws_route_table.private[1] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-00292935f495f11d2"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-00cb1d9e5e8a3d44f"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Environment" = "dev"
            "Name"        = "crispy-succotash-private-us-east-1b"
            "Project"     = "comics"
            "Terraform"   = "true"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.records.data.aws_route53_zone.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_route53_zone" "this"  {
      + arn                        = (known after apply)
      + caller_reference           = (known after apply)
      + comment                    = (known after apply)
      + id                         = (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      + name                       = "app.terraform-aws-modules-example.com"
      + name_servers               = (known after apply)
      + private_zone               = false
      + resource_record_set_count  = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.records.aws_route53_record.this[" A"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "app.terraform-aws-modules-example.com"
      + records         = [
          + "10.10.10.10",
        ]
      + ttl             = 3600
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.records.aws_route53_record.this["test CNAME test-primary"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "test.app.terraform-aws-modules-example.com"
      + records         = [
          + "test.example.com.",
        ]
      + set_identifier  = "test-primary"
      + ttl             = 5
      + type            = "CNAME"
      + zone_id         = (known after apply)

      + weighted_routing_policy {
          + weight = 90
        }
    }

  # module.records.aws_route53_record.this["test CNAME test-secondary"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = false
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "test.app.terraform-aws-modules-example.com"
      + records         = [
          + "test2.example.com.",
        ]
      + set_identifier  = "test-secondary"
      + ttl             = 5
      + type            = "CNAME"
      + zone_id         = (known after apply)

      + weighted_routing_policy {
          + weight = 10
        }
    }

  # module.zones.aws_route53_zone.this["app.terraform-aws-modules-example.com"] will be created
  + resource "aws_route53_zone" "this" {
      + arn           = (known after apply)
      + comment       = "app.terraform-aws-modules-example.com"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "app.terraform-aws-modules-example.com"
      + name_servers  = (known after apply)
      + tags          = {
          + "Environment" = "dev"
          + "Name"        = "app.terraform-aws-modules-example.com"
          + "Project"     = "comics"
          + "Terraform"   = "true"
        }
      + tags_all      = {
          + "Environment" = "dev"
          + "Name"        = "app.terraform-aws-modules-example.com"
          + "Project"     = "comics"
          + "Terraform"   = "true"
        }
      + zone_id       = (known after apply)
    }

  # module.zones.aws_route53_zone.this["private-vpc.terraform-aws-modules-example.com"] will be created
  + resource "aws_route53_zone" "this" {
      + arn           = (known after apply)
      + comment       = "private-vpc.terraform-aws-modules-example.com"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "terraform-aws-modules-example.com"
      + name_servers  = (known after apply)
      + tags          = {
          + "Environment" = "dev"
          + "Project"     = "comics"
          + "Terraform"   = "true"
        }
      + tags_all      = {
          + "Environment" = "dev"
          + "Project"     = "comics"
          + "Terraform"   = "true"
        }
      + zone_id       = (known after apply)

      + vpc {
          + vpc_id     = "vpc-0d01ecdccffefaf21"
          + vpc_region = (known after apply)
        }
    }

  # module.zones.aws_route53_zone.this["terraform-aws-modules-example.com"] will be created
  + resource "aws_route53_zone" "this" {
      + arn           = (known after apply)
      + comment       = "terraform-aws-modules-example.com (production)"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "terraform-aws-modules-example.com"
      + name_servers  = (known after apply)
      + tags          = {
          + "Environment" = "dev"
          + "Name"        = "terraform-aws-modules-example.com"
          + "Project"     = "comics"
          + "Terraform"   = "true"
        }
      + tags_all      = {
          + "Environment" = "dev"
          + "Name"        = "terraform-aws-modules-example.com"
          + "Project"     = "comics"
          + "Terraform"   = "true"
        }
      + zone_id       = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @diogoleal, Action: `pull_request`*